---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricWireLength
source: html/36921574-30d2-687f-5e8c-1045c62276c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricWireLength Property

"Wire length": The wire length

## Syntax (C#)
```csharp
public static ForgeTypeId FabricWireLength { get; }
```